Revit 2021.1 API
FormatOptions.UnitSymbol Property
 The unit symbol that should be displayed to indicate the units of the value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `GetSymbolTypeId()` and `SetSymbolTypeId(ForgeTypeId)` methods instead.")]
public UnitSymbolType UnitSymbol { get; set; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `GetSymbolTypeId()` and `SetSymbolTypeId(ForgeTypeId)` methods instead.")> _
Public Property UnitSymbol As UnitSymbolType
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `GetSymbolTypeId()` and `SetSymbolTypeId(ForgeTypeId)` methods instead.")]
public:
property UnitSymbolType UnitSymbol {
	UnitSymbolType get ();
	void set (UnitSymbolType value);
}
Field Value
 The unit symbol. The default is UST_NONE.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: unitSymbol is not a valid unit symbol for the display unit in this FormatOptions.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
FormatOptions Class
Autodesk.Revit.DB Namespace